src/test/resources/__files/payment/process_payment_card_with_airline_travel_details_response.json

{
  "id": "398e086d-f47b-4b3f-8a18-621e7ed35378",
  "paymentType": "CARD",
  "paymentHandleToken": "SC2INoYvSe2MzQuB",
  "merchantRefNum": "fc5b62df1202e491475d",
  "currencyCode": "USD",
  "settleWithAuth": true,
  "txnTime": "2023-01-27T10:15:29Z",
  "billingDetails": {
    "nickName": "Home",
    "street": "TEST",
    "city": "CA",
    "zip": "94404",
    "state": "CA",
    "country": "US"
  },
  "customerIp": "172.0.0.1",
  "status": "COMPLETED",
  "amount": 500,
  "preAuth": false,
  "description": "Magazine subscription",
  "availableToSettle": 0,
  "gatewayResponse": {
    "code": "VPS",
    "responseCode": "00",
    "responseCodeDescription": "Approved and completed",
    "avsCode": "X",
    "authCode": "130416",
    "avsResponse": "MATCH",
    "cvvVerification": "MATCH",
    "serializable": true
  },
  "merchantDescriptor": {
    "dynamicDescriptor": "100,test",
    "phone": "1000000000"
  },
  "settlements": [
    {
      "merchantRefNum": "fc5b62df1202e491475d",
      "amount": 500,
      "id": "398e086d-f47b-4b3f-8a18-621e7ed35378",
      "availableToRefund": 500,
      "txnTime": 1674814529000,
      "status": "PENDING"
    }
  ],
  "card": {
    "cardExpiry": {
      "month": "10",
      "year": "2025"
    },
    "holderName": "Dilip",
    "cardType": "VI",
    "cardBin": "400000",
    "lastDigits": "1026",
    "cardCategory": "CREDIT",
    "issuingCountry": "US"
  },
  "airlineTravelDetails": {
    "passengerName": "John Smith",
    "departureDate": "2023-05-25",
    "origin": "YUL",
    "computerizedReservationSystem": "BLAN",
    "customerReferenceNumber": "123456",
    "passengerNameRecord": "passNamRec",
    "additionalBookingReference": "additionalBookingRef",
    "totalFare": 1000,
    "totalFee": 100,
    "totalTaxes": 10,
    "ticket": {
      "ticketNumber": "198J8928",
      "isRestrictedTicket": false,
      "isAgencyCard": true,
      "ticketPrice": 10,
      "numberOfPax": 5
    },
    "passengers": {
      "passenger1": {
        "ticketNumber": "56827",
        "firstName": "firstName",
        "lastName": "lastName",
        "phoneNumber": "7181855783",
        "passengerCode": "INF",
        "gender": "M"
      },
      "passenger2": {
        "ticketNumber": "56827",
        "firstName": "firstName",
        "lastName": "lastName",
        "phoneNumber": "7181855783",
        "passengerCode": "INF",
        "gender": "M"
      }
    },
    "travelAgency": {
      "code": "AGCODE",
      "name": "Agency name",
      "agencyAddress": {
        "street": "street",
        "zip": "ZIP12",
        "country": "GB"
      }
    },
    "tripLegs": {
      "leg1": {
        "serviceClass": "F",
        "isStopOverAllowed": false,
        "destination": "CDG",
        "fareBasis": "VMAY",
        "departureDate": "2023-05-25",
        "serviceClassFee": 10,
        "departureAirport": "SOF",
        "departureTime": "2022-01-26T11:32:29Z",
        "arrivalTime": "2022-01-28T11:32:29Z",
        "conjunctionTicket": "T124",
        "couponNumber": "COUPON123",
        "notation": "sample",
        "taxes": "10",
        "flight": {
          "carrierCode": "TS",
          "flightNumber": "937",
          "airlineName": "BulgariaAir",
          "airlineIcaoCode": "DLH"
        }
      }
    },
    "cardSchemeTransactionId": "SIM1UZ3YM7IS1"
  }
}